//
//  ViewController.swift
//  20180615_2_TRA
//
//  Created by Yen on 2018/6/15.
//  Copyright © 2018年 Yen. All rights reserved.
//

import UIKit

class ViewController: UIViewController {
    let stationInfo = ["鳳山": "1402", "樹林": "1012", "豐田": "1607", "東港支線": "4202", "大山": "1104", "嘉義": "1215", "崁頂": "1412", "長興": "2108", "台中港貨": "2302", "麟洛": "1408", "南港": "1006", "嶺腳": "1906", "九讚頭": "2207", "永康": "1227", "多良": "1511", "枋山": "1504", "四城": "1819", "潮州": "1411", "龍泉": "2704", "新埔": "1108", "龍井": "1116", "新豐": "1022", "山里": "1631", "斗南": "1211", "龍井煤場": "2402", "成功": "1321", "八堵": "1002", "萬華": "1009", "花壇": "1202", "台(廢)東": "1634", "台中": "1319", "瑞芳": "1804", "三貂嶺": "1806", "富岡": "1020", "集集": "2705", "林鳳營": "1222", "北新竹": "1024", "浮洲": "1032", "泰安": "1314", "歸來": "1407", "新竹": "1025", "望古": "1905", "牡丹": "1807", "新烏日": "1324", "古莊": "1507", "東竹": "1622", "南調": "2802", "花蓮港": "3202", "台北": "1008", "玉里": "1619", "三坑": "1029", "東里": "1621", "石龜": "1212", "龍港": "1106", "豐原": "1317", "永靖": "1204", "永樂": "1703", "蘇澳新": "1826", "金崙": "1512", "壽豐": "1606", "南祥": "2107", "潭子": "1318", "中壢": "1017", "白沙屯": "1107", "大林": "1213", "談文南": "1103", "彰化": "1120", "馬(廢)蘭": "1633", "頭城": "1816", "六塊厝": "1405", "機廠": "3902", "屏東": "1406", "南科": "1244", "太麻里": "1514", "雙溪": "1808", "桃園": "1015", "基隆": "1001", "月美": "1627", "竹東": "2205", "新莊": "2213", "深澳": "2002", "海科館": "6103", "後庄": "1403", "三民": "1617", "南樹林": "1034", "高雄": "1238", "和仁": "1710", "汐科": "1031", "佳冬": "1416", "烏日": "1320", "知本": "1516", "新城": "1712", "侯硐": "1805", "志學": "1604", "五福": "2102", "海山站": "2109", "沙崙": "5102", "善化": "1225", "大溪": "1813", "礁溪": "1818", "鼓山": "1237", "中興二號": "3402", "南澳": "1705", "橋頭": "1234", "左營": "1236", "大武": "1508", "武塔": "1706", "嘉北": "1241", "鹿野": "1630", "竹田": "1410", "南州": "1413", "加祿": "1502", "林口": "2103", "社頭": "1205", "源泉": "2702", "羅東": "1823", "海湖站": "2110", "岡山": "1233", "南平": "1609", "關山": "1626", "新馬": "1825", "通霄": "1109", "新營": "1220", "香山": "1026", "貢寮": "1809", "康樂": "1517", "七堵": "1003", "安通": "1620", "新富": "1036", "大華": "1903", "富里": "1623", "新左營": "1242", "蘇澳": "1827", "二水": "1207", "後壁": "1219", "中里": "1822", "桃中": "2105", "神岡": "2502", "富源": "1614", "五堵": "1004", "漢本": "1708", "三姓橋": "1035", "枋寮": "1418", "和平": "1709", "榮華": "2211", "清水": "1114", "南靖": "1218", "車埕": "2707", "銅鑼": "1308", "談文": "1102", "板橋": "1011", "台中港": "1113", "崇德": "1711", "水里": "2706", "後龍": "1105", "追分": "1118", "外澳": "1815", "保安": "1229", "東南支線": "4302", "鳳林": "1610", "大肚": "1117", "舞鶴": "1635", "松山": "1007", "大慶": "1322", "瑞源": "1629", "六家": "2214", "員林": "1203", "新市": "1226", "楠梓": "1235", "水上": "1217", "枋野": "1505", "苑裡": "1110", "崎頂": "1027", "三義": "1310", "前鎮": "3102", "光復": "1612", "鎮安": "1414", "暖暖": "1802", "竹北": "1023", "大湖": "1231", "吉安": "1602", "北湖": "1033", "中洲": "1230", "北埔": "1714", "台南": "1228", "東澳": "1704", "濁水": "2703", "石榴": "1209", "萬榮": "1611", "瑞穗": "1616", "豐富": "1304", "平溪": "1907", "大肚溪南": "1119", "景美": "1713", "千甲": "2212", "花蓮": "1715", "橫山": "2206", "柳營": "1221", "富貴": "2209", "二結": "1821", "汐止": "1005", "沙鹿": "1115", "竹中": "2203", "拔林": "1224", "大富": "1613", "大甲": "1112", "九曲堂": "1404", "楊梅": "1019", "竹南": "1028", "四腳亭": "1803", "八斗子": "2003", "日南": "1111", "斗六": "1210", "石城": "1811", "中興一號": "3302", "溪口": "1608", "冬山": "1824", "合興": "2208", "隆田": "1223", "福隆": "1810", "民雄": "1214", "鶯歌": "1014", "后里": "1315", "瀧溪": "1510", "大村": "1240", "龜山": "1814", "西勢": "1409", "埔心": "1018", "內獅": "1503", "林內": "1208", "台東": "1632", "田中": "1206", "宜蘭": "1820", "菁桐": "1908", "路竹": "1232", "林邊": "1415", "東海": "1417", "長榮大學": "5101", "樹調": "4102", "苗栗": "1305", "池上": "1624", "造橋": "1302", "寶山": "2106", "南勢": "1307", "平和": "1605", "頂埔": "1817", "瑞和": "1628", "大橋": "1239", "湖口": "1021", "內灣": "2210", "太原": "1323", "中央": "1506", "上員": "2204", "電廠": "2104", "內壢": "1016", "百福": "1030", "高雄港": "2902", "仁德": "1243", "山佳": "1013", "大里": "1812", "十分": "1904", "海端": "1625"]


    var stationData: [String:String] = [:]
    
    var jsonObject:[String:Any] = [:]
    
    var trainInfos = NSArray()
    
    override func viewDidLoad() {
        super.viewDidLoad()
        do{
            //print("AA")
            if let url = URL(string: "http://localhost/phpPrj/TRA/20180615.json"){
                let data = try Data(contentsOf: url)
                self.jsonObject = try JSONSerialization.jsonObject(with: data, options: .allowFragments) as! [String:Any]
                //                print(jsonObject)
            }
        }catch{
            //print("BB")
            print(error)
        }
        
        
        
        trainInfos = jsonObject["TrainInfos"] as! NSArray
        for k,p in trainInfos{
            
            
            
        }
        


        
        //print(stationData)
        // Do any additional setup after loading the view, typically from a nib.
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }


}

